import React from 'react';
import {
  Container,
  Accordion,
} from 'amazeui-touch';
import '../../../style/public.css'
import '../../../style/rule.css';
class AccordionExample extends React.Component{
  componentWillMount(){
    document.title='牦牛出行《用户协议》';
    document.body.style.background='#fff';
  }
  render() {
    return (
      <div className="index">
        <div className="cancelRule">
          <div>
            <div className="rule-content">
              <p>
                我们西藏佳斯特信息技术有限公司（以下称“我司”）是一家以大数据服务和人工智能为基础的产业互联网公司。
                通过实时的线上线下信息交互，线下资源借助大数据分析的有效匹配，
                为您提供多样化的网约车服务（以下简称“网约车服务”），
                您访问和使用有关网站、服务、应用程序提供的快车预约功能适用本用户服务协议（以下简称“协议”）。
              </p>
             <p  className="fontWeight">
               在您注册、使用有关网站、应用程序及接受我司平台中的网约车服务之前，请您认真阅读本协议（尤其是粗体标注部分）。
               您选择并使用服务即视为您已充分阅读并接受本协议的所有条款，您同意本协议对您和我司具有法律约束力。
            </p>
            </div>
            <div className="rule-header fontSize25">第一条 用户注册</div>
            <div className="rule-content">
              <p>1.1为您使用网约车服务，您必须在移动设备上下载“牦牛出行”应用程序（以下称“牦牛出行平台”）并进行注册，注册时您必须保证提供真实有效的信息、移动电话号码等，
                <span className="fontWeight">您知晓并同意，您一经成为牦牛出行平台注册用户，将会默认开通我司服务账户，账号及密码默认为牦牛出行平台账户的账号和密码。</span></p>
              <p>1.2如果您是代表个人签订本协议，您应具备完全民事行为能力（年满18周岁或年满16周岁、以自己劳动收入为主要生活来源，且精神健康能完全辨认自己的行为）。</p>
              <p>1.2.1如果您年满12周岁但尚未具备完全的民事行为能力，请在征得您的监护人同意后签署本协议，并由监护人陪同乘车，否则驾驶员可以拒绝运送并取消行程。
                如您未经监护人同意即签署本协议或坚持独自乘车，因您已具备相应的智力、判断水平，本协议仍然有效，因本协议及您的行为产生的义务和责任将由您或您的监护人承担。
                对于您的监护人未妥善履行监护责任的情况下，导致您自身损失或给他人造成损失的，将由您的监护人承担相应责任。</p>
              <p>1.2.2如您尚未年满12周岁或存在其他无民事行为能力的情况，请勿签署本协议或在无监护人陪同的情况下乘车。如驾驶员发现您属于上述情况，
                应当拒绝运送并取消行程。如您违反本条要求，导致自身损失或给他人造成损失的，将由您的监护人承担相应责任。</p>
              <p>1.3您应妥善保管自己的账号及密码，不得将其提供给他人使用，或允许不具备完全民事行为能力的人在无监护人陪同的情况下单独乘车。如因您未妥善保管账号及密码，或违反本条要求，允许不具备完全民事行为能力的人使用您的账号单独乘车，
                由此产生的义务和责任将由您承担。如因此给他人造成损失的，将由您承担相应责任。</p>
              <p>1.4如果您是代表法人实体签订本协议，您应获得授权并遵守本《用户服务协议》（并约束该法人实体）。</p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第二条 服务内容</div>
            <div className="rule-content">
              <p>您在牦牛出行平台上，可获取您需要的网约车服务。您可通过下载并安装到移动设备上的“牦牛出行”应用程序选择并使用上述服务。</p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第三条 合同订立</div>
            <div className="rule-content">
              <p>您理解并同意，您通过牦牛出行平台选择使用我们的服务，即视为接受本《用户服务协议》并依据本协议与我司达成合约（以下简称“合约”）。</p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第四条 服务使用</div>
            <div className="rule-content">
              <p>4.1您可以通过牦牛出行平台提出预约快车用车需求。我司将按照您的预约信息匹配符合您需求的适合车辆。 </p>
              <p>4.2我司将做出合理的努力，让您获得服务。但这受制于您请求服务之时所在位置周边是否有可提供服务的车辆。</p>
              <p>4.3为防止驾驶员私自更换车辆、出借账号等行为的发生，您在乘坐车辆前，请仔细核对车辆及及驾驶员信息是否与平台所显示的车辆、驾驶员信息一致。如发现车辆及驾驶员与平台显示的信息不一致，应拒绝乘坐，并可向平台客服投诉，平台核实后可以按照平台用户规则对驾驶员用户予以追责。</p>
              <p>4.4您不得在不乘坐车辆的情况下，委托驾驶员单独运送物品，对于违反平台规则要求运送物品的订单，驾驶员应当拒绝运送并取消行程。如驾驶员违反禁止性的平台规则予以追责，并且驾驶员需要要承担因私自运送物品所需承担的相应注意义务，如驾驶员运送危险品或违禁品构成违法、犯罪的，可能由此承担相应的刑事或行政责任，如驾驶员发现乘客委托运送的物品可能是病毒等法律禁止运输或持有的违禁物品，应当前往就近的公安机关报案检查。</p>
              <p>4.5您不得携带危险物品或者其他法律、法规规定禁止或不适宜携带的物品搭乘车辆驾驶员的车辆，否则车辆驾驶员有权拒绝提供服务，并由您承担任何携带该等物品引起的后果和责任。</p>
              <p>4.6您不得在使用服务过程中进行违反平台规则的不文明的行为（包括吸烟、喝酒、吐痰、以及其他违反平台规则的行为），不得进行或要求车辆驾驶员进行违反相关交通规则或者其他法律法规的行为，因您违反禁止行为的原因导致有关部门行政处罚、人员受伤、发生交通事故、造成车辆损坏或其他损失的，您应向受损方进行赔偿。</p>
              <p>4.7您作为乘客，应当保证发布出行信息时是自愿的，且不存在意识不清楚、酒醉等情形。若您有意识不清楚、醉酒等情形的，陪同人员代为发布出行需求信息视为您的行为；在您醉酒或在其他意识不清楚的情况下，应当有意识清楚的第三方陪同；在您饮酒、醉酒或已是不清楚的情况下，给他人造成损失的，您应当就相应损失予以赔偿。</p>
              <p>4.8您不得在未获得车辆驾驶员事先同意的情况下，在使用服务过程中进行拍照、录音、录像、网络直播等行为。在征得车辆驾驶员同意的前提下进行拍照、录音、录像等行为所获得的内容仅能为记录服务过程中的证明信息之目的，不得通过网络传播、线下拷贝等任何方式进行复制、传播、扩散等。</p>
              <p>4.9您在使用网约车服务过程中获得的其他牦牛出行平台用户的个人信息，除相关法律允许外，您不得向任何第三方公开、透露上述个人信息。</p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第五条 担保及承诺</div>
            <div className="rule-content">
              <p>5.1您担保，您向我们提供的信息真实、准确、完整。为实现网约车服务功能，我们有权验证您所提供的信息，并有权在不提供任何理由的情况下拒绝向您提供服务或拒绝您使用有关网站、服务、应用程序。</p>
              <p>5.2您使用我司服务或牦牛出行平台，即表示您还同意以下事项：<br/>
                a.您出于您个人用途使用服务或下载应用程序，并且不会转售给第三方;<br/>
                b.您不会将服务或应用程序用于非法目的，包括（但不限于）发送或存储任何非法资料或者用于欺诈目的；<br/>
                c.您不会利用服务或应用程序骚扰、妨碍他人或造成不便；<br/>
                d.您不会影响网络的正常运行；<br/>
                e.您不会尝试危害服务或应用程序；<br/>
                f.当我们提出合理请求时，您会提供身份证明；<br/>
                g.您将遵守国家/地区以及您在使用应用程序或服务时所处国家/地区、省和/或市的所有适用法律。
            </p>
              <p>5.3如果您违反以上任一约定，我们保留立即终止向您提供服务或拒绝您使用有关网站、服务、应用程序的权利。</p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第六条 付款及发票</div>
            <div className="rule-content">
              <p className="fontWeight">6.1 您同意并认可牦牛出行平台现行公示或未来更新的有关服务价格标准，您可以在网站上或牦牛出行平台上查看有关服务的价格。这些价格可能会随时更新，您必须自行留意服务的价格</p>
              <p className="fontWeight">6.2 您在使用服务后应根据牦牛出行平台提示及时支付费用。逾期不支付费用且经催告后仍不履行支付义务的，我司有权拒绝您继续使用服务，同时您知悉并同意我司有权视情况将您的违约信息提交第三方征信机构。</p>
              <p>6.3 您在牦牛出行平台可以使用您的第三方电子支付账户（包括但不限于微信支付账户或支付宝支付账户）进行支付。处理您使用服务相关的付款时，除了受到本《用户服务协议》的约束之外，还要受电子支付服务商及信用卡/借记卡发卡行的条款和政策的约束。
                我们对于电子支付服务商或银行发生的错误不承担责任。我们将获取与您使用服务相关的特定交易明细。在使用这些信息时我们将严格遵守相关法律法规和公司的各项政策。</p>
              <p className="fontWeight">6.4 在您提出开具发票的要求时，我们将为您开具发票，具体发票开具及申请规则，请参见应用程序上所列示的开票说明。</p>
              <p>6.5 我们提供订单管理功能，您可以随时通过手机应用端查询订单情况。您应在每次服务完成后及时查询实际付款情况，如有异议应当在服务完成后48小时内联系我们，我们将对您提出的异议进行解释和处理。</p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第七条 赔偿</div>
            <div className="rule-content">
              <p>
                您使用牦牛出行平台的各应用程序及服务，即表示您接受本《用户服务协议》并同意：对于因以下事项产生的或与以下事项相关的任何及所有索赔、费用、赔偿、损失、债务和开销（包括但不限于律师费和诉讼费），您应该予以赔偿：<br/>
                a.您触犯或违反本《用户服务协议》中的任何条款或任何适用的法律法规(无论此处是否提及);<br/>
                b.您触犯任何第三方的任何权利；<br/>
                c.您滥用应用程序或服务。<br/>
                d. 您因故意或重大过失对车辆及其内部设施造成损坏。
              </p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第八条 责任</div>
            <div className="rule-content">
              <p>
                8.1在网站或牦牛出行平台上向您提供的信息、推荐的服务仅供您参考。我们将在合理的范围内尽力保证该等信息准确，
                但无法保证其中没有任何错误、缺陷、恶意软件和病毒。
                对于因使用（或无法使用）网站或牦牛出行平台导致的任何损害（但排除死亡或人身伤害），
                我们不承担责任（除非此类损害是由我们的故意或重大过失造成的）。
                此外，对于因使用（或无法使用）与网站或牦牛出行平台的电子通信手段导致的任何损害，
                包括（但不限于）因电子通信传达失败或延时、第三方或用于电子通信的计算机程序对电子通信的拦截或操纵，
                以及病毒传输导致的损害，我们不承担责任。
              </p>
              <p className='fontWeight'>
                8.2您知悉并确认，您通过牦牛出行信息平台预约的网约车服务，由我司根据您发出的用车需求信息，经过后台大数据信息处理，在用户终端上提供可使用的网约车信息，并由最终匹配成功的驾驶员实际向您提供线下运输。为更好的保障用户权益，我司将通过平台规范的方式约束平台中的参与方严格遵守平台规则，保障用户权益，我司负责平台规则的合理化及监督规则的实施。从需求用户发送订单并由系统成功匹配开始，到订单完成之时，为线上网约车平台交易信息服务区间，其中从乘客肢体接触到线下服务车辆起始，至线下运输服务结束乘客离开运输工具止，为驾驶员为用户提供线下网约车运输服务区间。平台参与方在网约车服务提供区间内，在法律范围内承担相应的责任。同时，为提升服务品质，保障平台用户（包括驾驶员与乘客）安全，并更好的承担企业
                社会责任，我司将通过个性化的安全保障产品为标有保障产品的订单服务中的平台用户提供相应的安全保障服务，例如对于交通事故和车内冲突等与平台订单相关联的意外事故，在实际责任方无力赔偿或在合理时间内未赔偿的情况下，可以按照相应的安全保障产品说明规定的内容提供先行垫付、住院探望等服务。对于存在侵权责任人、违约责任人的，在提供安全保障服务后，提供安全保障服务的相关方有权向有关实际责任方追偿。
              </p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第九条 授权及许可</div>
            <div className="rule-content">
              <p>
                9.1在您遵守本《用户服务协议》的前提下，我们授予您有限的、非排他性的、不可转让的如下许可： <br/>
                以将一份应用程序副本下载并安装到您拥有或控制的单台移动设备上，并仅出于您自己的个人用途运行此应用程序副本。您不得：<br/>
                （1）以任何方式许可、再许可、出售、转售、转让、分配、分发服务或应用程序，或以其他方式进行商业开发或提供给任何第三方；<br/>
                （2）修改服务或应用程序，或者据此创建衍生产品；<br/>
                （3）创建指向服务的互联网“链接”，或在任何其他服务器或基于无线或互联网的设备上“设计”或“镜像”任何应用程序；<br/>
                （4）反向工程或访问应用程序设计或构建竞争产品或服务、使用类似于服务或应用程序的设想或图形来设计或构建产品，或抄袭服务或应用程序的任何设想、特点、功能或图形，或启动自动程序或脚本，每秒发送多个服务器请求或过度加重服务或应用程序负担或妨碍其工作和/或性能的程序。
              </p>

              <p>
                9.2此外，您不得：<br/>
                （1）发送垃圾邮件或者以其他形式违反适用法律的重复或不受欢迎的邮件；<br/>
                （2）发送或存储侵权、淫秽、威胁、诽谤或者其他非法或侵权资料，包括危害儿童或触犯第三方隐私权的资料；<br/>
                （3）发送或存储包含软件病毒、蠕虫、木马或其他有害的计算机代码、文件、脚本、代理或程序的资料；<br/>
                （4）阻挠或扰乱网站、应用程序、服务或其所含数据的完整性或性能；<br/>
                （5）尝试未经授权地访问网站、应用程序、服务或其相关系统或网络。
              </p>
              <p>
                9.3 在法律允许的最大范围内，我们将有权调查并起诉任何上述违法违规行为。
                我们可参与并协助执法部门起诉违反本《用户服务协议》的用户。
                如果我们认为任何内容违反本《用户服务协议》或以其他方式危害网站、
                平台及/或其中的服务或应用程序，
                我们保留在不另行通知的情况下随时删除或禁用对这些内容的访问权限的权利。
              </p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第十条 知识产权政策</div>
            <div className="rule-content">
              <p>我们遵守各类适用的知识产权法律法规，并希望用户也遵守。</p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第十一条 第三方链接</div>
            <div className="rule-content">
              <p>
                在您使用网站、应用程序期间，我们可能会不时地提供由第三方拥有并控制的网站链接，
                以便您跟第三方沟通，向其购买产品或服务，参加其提供的促销活动。
                该等链接会带领您离开网站、牦牛出行平台，
                并且该等链接所指向的第三方网站内容不在我们的控制范围之内，
                这些第三方网站各自订立了条款、条件和隐私政策。因此，我们不会对这些网站的内容和活动负责，
                也不会承担任何义务，
                您应充分理解该等网站的内容及活动并自己全力承担浏览或访问这些网站的法律责任及风险。
              </p>
            </div>
          </div>

          <div>
            <div className="rule-header fontSize25">第十二条 合约期限</div>
            <div className="rule-content">
              <p>
                12.1 我们和您订立的这份合约是无固定期限合约。
              </p>
              <p>
                12.2 您有权随时通过永久性删除智能手机上安装的应用程序来终止合约，这样将禁止您使用牦牛出行平台及其中的应用程序和服务。您可以随时按照我们网站上的说明注销用户账户。
              </p>
              <p>
                12.3 如果您做出以下行为，我们有权随时终止合约并立即生效（即禁止您使用应用程序和服务）：<br/>
                a.您触犯或违反本《用户服务协议》中的任何条款；<br/>
                b.我们认为，您滥用应用程序或服务。我们没有义务提前通知合约终止。终止合约之后，我们将按照本《用户服务协议》给出相关通知。
              </p>
            </div>
          </div>

          <div>
            <div className="rule-header fontSize25">第十三条 不可抗力</div>
            <div className="rule-content">
              <p>
                遭受不可抗力事件的一方可暂行中止履行本协议项下的义务直至不可抗力事件的影响消除为止，并且无需为此承担违约责任，但应尽最大努力克服该事件，减少损失的扩大。不可抗力指各方不能控制、不可预见或即使预见亦无法避免的事件，该事件足以妨碍、影响或延误任何一方根据本协议履行其全部或部分义务。
                该事件包括但不限于自然灾害、战争、政策变化、计算机病毒、黑客攻击或电信机构服务中断造成的事件。
              </p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第十四条 其他</div>
            <div className="rule-content">
              <p>
                14.1 如果本《用户服务协议》的某一（些）条款被认定为无效而其他条款仍能保持有效且其执行不受影响，我们可决定是否继续履行该等其他条款。
               </p>
                <p>
                 14.2 我们保留随时修改或替换本《用户服务协议》条款，或者更改、暂停或中断服务或应用程序（包括但不限于，任何功能、数据库或内容的可用性）的权利。届时，我们只需在网站及/或牦牛出行平台上发布通告或发送通知。您如果不同意我们对本《用户服务协议》所做的修改，您有权停止使用服务。如果您继续使用服务，则视为您接受我们对本《用户服务协议》所做的修改。
               </p>
              <p>
                14.3 我们可以通过以下途径发送通知：在网站及/或牦牛出行平台上张贴一般通知；按照您在账户信息中登记的电子邮件地址或电话发送电子邮件或短信。
              </p>
              <p>
                14.4事先未经我们的书面同意，您不得转让本《用户服务协议》中的权利。
              </p>
            </div>
          </div>
          <div>
            <div className="rule-header fontSize25">第十五条 管辖约定</div>
            <div className="rule-content">
              <p className="fontWeight">
                本《用户服务协议》适用中国法律。关于本《用户服务协议》的违约、终止、履行、解释或有效性，或者网站、牦牛出行平台的使用所产生的或与其相关的任何冲突、赔偿或纠纷（统称为“争议”），由根据中华人民共和国法律具有管辖权的法院管辖。
              </p>
            </div>
          </div>

        </div>
      </div>
    );
  }
};

export default AccordionExample;
